StressTest.yml
config:
  processor: './stressTestScript.js'
  target: 'http://localhost:3000'
  phases:
    - duration: 10
      arrivalRate: 10
      rampTo: 1000
      name: '10-1000'
scenarios:
  - name: "Getting Flight Information"
    flow: 
      - function: 'generateRandomData'
      - get:
          url: "/flightInfo"
      # - post:
      #     url: "/courses"
      #     json:
      #       title: "{{ title }}"
      #       description: "{{ description }}" 
      #       tag: "{{ tag }}"
      #       avgRating: "{{ avgRating }}"
      #       totalRatings: "{{ totalRatings }}"
      #       enrollment: "{{ enrollment }}"
      #       createdBy: "{{ createdBy }}"
      #       lastUpdated: "{{ lastUpdated }}"
      #       language: "{{ language }}"
      #       imgUrl: "{{ imgUrl }}"
      #       listPrice: "{{ listPrice }}"
      #       discountPrice: "{{ discountPrice }}"
      #       videoHrs: "{{ videoHrs }}"
      #       totalArticles: "{{ totalArticles }}"
      #       totalDownloads: "{{ totalDownloads }}"
      #       activeCoupon: "{{ activeCoupon }}"
      #       ccOptions: "{{ ccOptions }}"